export const weekDays = [
    ["Воскресенье", "Понедельник", "Вторник", "Среда", "Четверг", "Пятница", "Суббота", "ru"],
    ["Sunday", "Monday", "Tuesday", "Wednesday", "Thursday", "Friday", "Saturday", "en"],
    ["Нядзеля", "Панядзелак", "Аўторак", "Серада", "Чацвер", "Пятніца", "Субота", "be"]
]

export const beDate = [
    ["вс,", "пн,", "вт,", "ср,", "чт,", "пт,", "сб,"],
    ["нд,", "пн,", "аў,", "ср,", "чц,", "пт,", "сб,"],
    ["января,", "февраля,", "марта,", "апреля,", "мая,", "июня,", "июля,", "августа,", "сентября,", "октября,", "ноября,", "декабря,"],
    ["cтудзеня,", "лютага,", "сакавiка,", "красавiка,", "мая,", "червеня,", "лiпеня,", "жніўня,", "верасня,", "кастрычнiка,", "лiстапада,", "снежня,"]
]

export const weatherConditions = [
    ["Ощущается", "Скорость ветра", "м/с", "Влажность", "ru"],
    ["Feels like", "Wind", "m/s", "Humidity", "en"],
    ["Адчуваецца", "Хуткасць ветру", "м/с", "Вільготнасць", "be"]
]

export const coordinatesLang =  [
    ["Широта", "Долгота", "ru"],
    ["Latitude", "Longitude", "en"],
    ["Шырата", "Даўгата", "be"]
]